<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.5.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Loupe Browser 9.</string>
	<key>Identifier</key>
	<string>com.github.jschneppe.download.LoupeBrowser9</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Loupe Browser 9</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
				<key>url</key>
				<string>https://cf.10xgenomics.com/releases/cell-exp/Loupe-Browser-9.0.0.dmg?Expires=1762896363&amp;Key-Pair-Id=APKAI7S6A5RYOXBWRPDA&amp;Signature=KzFCpT7GzDp64xRqLAqW4sxaiNFuuSYGTqTNAtW8EcNu2FbZwUw7l4Oy-2cwHzL4w3H4n9boREsXmxqrPqax356FseiImjah7F2HW-g~8On~LeB4V9eKNUiG9IvFLrM4-L8oMxU35lLUqK-So1eACZ3ZOQcw4fG3xteFsfYZDYirUsZFEC1RKYYCLASpT3oTdA4lieTd8DGtmcO3~ECt5IRhxEmNvVoBbMLdg2DZas~~rx4E8Bo-Jzvsw50YL4vfqz8iMwJNo4OEGCQiy10-iKsLaLo6ZaynkzJMPRagArEzTkRFO8tLk8tdIwTLBw~CkZBRwI5nU01dF05oHZFtDQ__</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Loupe Browser 9.app</string>
				<key>requirement</key>
				<string>identifier "com.10xgenomics.loupecellbrowser8" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "384T6Y7Q52"</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%pathname%/Loupe Browser 9.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
	</array>
</dict>
</plist>
