<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Downloads the latest version of SSHFS and imports it into Munki, requires fuse for macos</string>
	<key>Identifier</key>
	<string>com.github.jschneppe.munki.sshfs</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>SSHFS</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Secure Shell (SSH) is a network protocol for secure communication between two computers. SSHFS is a FUSE file system to mount and interact with directories and files located on remote servers using the SSH File Transfer Protocol (SFTP).

This package contains a universal build of SSHFS, that is based on FUSE for OS X and supports Mac OS X 10.5 and later. FUSE for OS X needs to be installed separately. The latest version can be obtained from http://osxfuse.github.io.</string>
			<key>category</key>
			<string>Utilities</string>
			<key>developer</key>
			<string>Benjamin Fleischer</string>
			<key>display_name</key>
			<string>SSHFS</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.jschneppe.download.sshfs</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
    </array>
</dict>
</plist>
