<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads QuPath pkg and imports into Munki.
    <key>Identifier</key>
    <string>com.github.jschneppe.munki.firefox-esr</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/qupath</string>
        <key>NAME</key>
        <string>QuPath</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>sf_apps</string>
            </array>
            <key>description</key>
            <string>QuPath is an open, powerful, flexible, extensible software platform for whole slide image analysis.</string>
            <key>display_name</key>
            <string>QuPath</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.jschneppe.download.qupath</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>apps/QuPath</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
