<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of Rocket.Chat</string>
    <key>Identifier</key>
    <string>com.github.jschneppe.download.RocketChat</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>RocketChat</string>
        <key>PATTERN</key>
        <string>https:[^ '"]*\.dmg</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://github.com/RocketChat/Rocket.Chat.Electron/releases</string>
                <key>re_pattern</key>
                <string>%PATTERN%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%match%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Rocket.Chat.app</string>
                <key>requirement</key>
                <string>identifier "chat.rocket" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = S6UPZG7ZR3</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
