<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads Firefox disk image and imports into Munki.
Some useful values for RELEASE are: 'esr-latest'.
LOCALE controls the language localization to be downloded.
Examples include 'en-US', 'de', 'sv-SE', and 'zh-TW'
See the following URLs for more info:
    http://ftp.mozilla.org/pub/firefox/releases/latest-esr/README.txt</string>
	<key>Identifier</key>
	<string>com.github.jschneppe.install.firefox-esr</string>
	<key>Input</key>
	<dict>
        <key>RELEASE</key>
        <string>latest</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.jschneppe.download.firefox-esr</string>
	<key>Process</key>
	<array>
		<dict>
            <key>Processor</key>
            <string>InstallFromDMG</string>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%pathname%</string>
				<key>items_to_copy</key>
                <array>
                    <dict>
                        <key>source_item</key>
                        <string>Firefox.app</string>
                        <key>destination_path</key>
                        <string>/Applications/</string>
                    </dict>
                </array>
			</dict>
		</dict>
	</array>
</dict>
</plist>
