<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest Thunderbird ESR release

Set the 'LOCALE' variable to the required language version.
Set the 'OS_TYPE' variable to the required Operating Systems.

List of available locale codes and supported Operating Systems here: https://releases.mozilla.org/pub/thunderbird/releases/latest-esr/README.txt</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.munki.Thunderbird ESR</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/thunderbird</string>
        <key>NAME</key>
        <string>ThunderbirdESR</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Extended Support Release (ESR), of the Thunderbird free and open source web browser.</string>
            <key>display_name</key>
            <string>Thunderbird ESR</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>unattended_uninstall</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.dataJAR-recipes.download.Thunderbird ESR</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>